laptop/Laptop.org
*** org-babel

Enable Org-babbel for emacs-lisp, shell and python. Turn on org-babel-tangle.

#+begin_src emacs-lisp

  (with-eval-after-load 'org
    (require 'ob-go)
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((lisp . t)
       (scheme . t)
       (emacs-lisp . t)
       (shell . t)
       (go . t)
       (python . t)))

    (push '("conf-unix" . conf-unix) org-src-lang-modes))

  (setq org-confirm-babel-evaluate nil)

  ;; This is needed as of Org 9.2
  (with-eval-after-load 'org
    (require 'org-tempo)

    (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
    (add-to-list 'org-structure-template-alist '("py" . "src python"))
    (add-to-list 'org-structure-template-alist '("go" . "src go"))
    (add-to-list 'org-structure-template-alist '("sc" . "src scheme"))
    (add-to-list 'org-structure-template-alist '("li" . "src lisp"))
    (add-to-list 'org-structure-template-alist '("nx" . "src nix")))


  ;; Automaticly tangle Emacs.org on save
  (defun geokkjer/org-babel-tangle-config ()
    (when (string-equal (buffer-file-name)
                        (expand-file-name "~/dotfiles/systems/laptop/Laptop.org"))

      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'geokkjer/org-babel-tangle-config)))

  (setq org-src-tab-acts-natively t)

#+end_src

*** lorem ipsum generator

Sometimes you need some dummy text

#+begin_src emacs-lisp
  (use-package lorem-ipsum
    :after org)
#+end_src
** Development

Making Emacs have the functionality of an IDE. And other things that are related to development.

** Languages and lsp-mode configuration

Configuration for different programming languages that I use, or want to learn.

*** lsp-mode

lsp-mode is a mode TODO:

**** lsp-basic

lsp-mode basic configuration including automatic headerline in lsp-mod . description. TODO

#+begin_src emacs-lisp

  (defun geokkjer/lsp-mode-setup ()
    (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
    (lsp-headerline-breadcrumb-mode))

  (use-package lsp-mode
    :commands (lsp lsp-deferred)
    :hook ((lsp-mode . geokkjer/lsp-mode-setup)
           (lsp-mode . lsp-enable-which-key-integration))
    :init
    (setq lsp-keymap-prefix "C-c l"))

  ;; (use-package  lsp-org
  ;;    :after lsp)

#+end_src

**** lsp-ivy

#+begin_src emacs-lisp

  (use-package lsp-ivy
    :after lsp)
  
#+end_src

**** lsp-ui

lsp-ui is .. TODO

#+begin_src emacs-lisp

  (use-package lsp-ui
    :hook (lsp-mode . lsp-ui-mode)
    :custom
    (lsp-ui-doc-psition 'bottom))

  (setq lsp-ui-sidline-enable nil)
  (setq lsp-ui-sideline-show-hover nil)

#+end_src

**** lsp-treemacs

TODO: explore treemacs

#+begin_src emacs-lisp

  (use-package lsp-treemacs
    :after lsp)
  
#+end_src

*** Lisp and Scheme

#+begin_src emacs-lisp

  (use-package geiser-mit
    :ensure t)
  (use-package geiser-racket
    :ensure t)
  (use-package geiser-guile
    :ensure t)

#+end_src

*** Web-mode


#+begin_src emacs-lisp

  (use-package web-mode
    :mode "\\.html\\'"
    :hook (web-mode . lsp-deferred)
    :config
    (add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode))
    (setq web-mode-engines-alist '(("django" . "\\.html\\'"))))

  ;; Simple-httpd webserver to preview webpages
  (use-package simple-httpd
    :ensure t)
  
#+end_src

*** Typescript

Used as an example of how to 
#+begin_src emacs-lisp

  (use-package typescript-mode
    :mode "\\.ts\\'"
    :hook (typescript-mode . lsp-deferred)
    :config
    (setq typescript-indent-level 2))

#+end_src

*** Python

Python IDE config. Sets up python mode to trigger on .py files. Then sets up lsp-python-ms to find python-language-server on NixOS.

#+begin_src emacs-lisp

  (use-package python-mode
    :ensure nil
    :hook (python-mode . lsp-deferred)
    :custom
    (python-shell-interpreter "python3")
    :mode "\\.py\\'"
    :config
    )

  (use-package pyvenv
    :after python-mode
    :config
    (pyvenv-mode 1))

  (use-package lsp-python-ms
    :ensure t
    :hook (python-mode . (lambda ()
                         (require 'lsp-python-ms)
                         (lsp-deferred)))
    :init
    (setq lsp-python-ms-executable (executable-find "python-language-server")))

#+end_src

*** GO
#+begin_src emacs-lisp
  
  (use-package ob-go)
  (use-package go-mode)

  (require 'lsp-mode)
  (add-hook 'go-mode-hook #'lsp-deferred)

  ;; Set up before-save hooks to format buffer and add/delete imports.
  ;; Make sure you don't have other gofmt/goimports hooks enabled.
  (defun lsp-go-install-save-hooks ()
    (add-hook 'before-save-hook #'lsp-format-buffer t t)
    (add-hook 'before-save-hook #'lsp-organize-imports t t))
  (add-hook 'go-mode-hook #'lsp-go-install-save-hooks)

#+end_src

*** Rust

#+begin_src emacs-lisp
  (use-package rust-mode
    :ensure nil
    :hook (rust-mode . (lambda ()
                         (require 'lsp-rust-server
                                  (lsp-deferred))
                         (prettify-symbols-mode)))
    :mode "\\.rs\\'")

  (setq rust-format-on-save t)

  (use-package flycheck-rust)
  (with-eval-after-load 'rust-mode
    (add-hook 'flycheck-mode-hook #'flycheck-rust-setup))


#+end_src

*** SQL

#+begin_src emacs-lisp

  (use-package sql-indent)

#+end_src

*** nix

TODO

#+begin_src emacs-lisp

  (use-package nix-mode
    :mode "\\.nix\\'")

  (add-to-list 'lsp-language-id-configuration '(nix-mode . "nix"))
  (lsp-register-client
   (make-lsp-client :new-connection (lsp-stdio-connection '("rnix-lsp"))
                    :major-modes '(nix-mode)
                    :server-id 'nix))

#+end_src

*** K8s

#+begin_src emacs-lisp

  (use-package kubernetes
    :commands kubernetes-overview
    :config
    (setq kubernetes-poll-frequency 3600
          kubernetes-redraw-frequency 3600))

  (use-package kubernetes-evil
    :ensure t
    :after kubernetes)

#+end_src

*** yaml mode
#+begin_src emacs-lisp
  
  (use-package yaml-mode)

#+end_src

** Code completion with company-mode

Company provides bette completions TODO:

#+begin_src emacs-lisp

  (use-package company
    :after lsp-mode
    :hook (lsp-mode . company-mode)
    :bind (:map company-active-map
            ("<tab>" . company-complete-section))
          (:map lsp-mode-map
            ("<tab>" . company-indent-or-complete-common))
    :custom
    (company-minimum-orefix-lenght 1)
    (company-idle-delay 0.0))

  (use-package company-box
    :hook (company-mode . company-box-mode))

#+end_src

** Commenting

Useeful for commenting or uncommenting lines of code in modal editing mode.

#+begin_src emacs-lisp

  (use-package evil-nerd-commenter
    :bind ("M-/" . evilnc-comment-or-uncomment-lines))

#+end_src

** Rainbow Delimiters

Really helpful

#+begin_src emacs-lisp

  ;; rainbow-delimiters
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))

#+end_src

** Flycheck

Flycheck is a modern on-the-fly syntax checking extension for GNU Emacs, intended as replacement for the older Flymake extension which is part of GNU Emacs.

[[https://www.flycheck.org/][Syntax checking for GNU Emacs
]]
#+begin_src emacs-lisp

  (use-package flycheck
    :ensure t
    :init (global-flycheck-mode))

#+end_src

** Projectile

Projectile description .TODO

#+begin_src emacs-lisp

  ;; TODO learn to use projectile
  (use-package projectile
    :diminish
    :config
    :custom ((projectile-completion-system 'ivy))
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :init
    (when (file-directory-p "~/Projects/Code")
      (setq projectile-projects-search-path '("~/Projects/Code")))
    (setq projectile-switch-project-action #'projectile-dired))

  (use-package counsel-projectile
    :after projectile
    :config (counsel-projectile-mode))

#+end_src

** Git and Magit

MAGIT description. TODO

#+begin_src emacs-lisp

  ;; TODO learn git and Magit
  (use-package magit
    :commands magit-status
    :custom
    (magit-display-buffer-function
     #'magit-display-buffer-same-window-except-diff-v1))

  ;; TODO config for service
  (use-package forge
    :after magit)

#+end_src

** Helpful and general

#+begin_src emacs-lisp
 
  (use-package helpful
    :commands (helpful-callable helpful-variable helpful-command helpful-key)
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))

  (use-package general
    :after evil
    :config
    (general-create-definer geokkjer/leader-keys
      :keymaps '(normal insert visual emacs)
      :prefix "SPC"
      :global-prefix "C-SPC")
    (geokkjer/leader-keys
      "t"  '(:ignore t :which-key "toggles")
      "tt" '(counsel-load-theme :which-key "choose theme")))

#+end_src

